{
 "module": "keras",
 "class_name": "Sequential",
 "config": {
  "name": "sequential_4",
  "trainable": true,
  "dtype": {
   "module": "keras",
   "class_name": "DTypePolicy",
   "config": {
    "name": "float32"
   },
   "registered_name": null
  },
  "layers": [
   {
    "module": "keras.layers",
    "class_name": "InputLayer",
    "config": {
     "batch_shape": [
      null,
      224,
      224,
      3
     ],
     "dtype": "float32",
     "sparse": false,
     "name": "input_layer_6"
    },
    "registered_name": null
   },
   {
    "module": "keras.src.models.functional",
    "class_name": "Functional",
    "config": {
     "name": "efficientnetv2-b3",
     "trainable": false,
     "layers": [
      {
       "module": "keras.layers",
       "class_name": "InputLayer",
       "config": {
        "batch_shape": [
         null,
         224,
         224,
         3
        ],
        "dtype": "float32",
        "sparse": false,
        "name": "input_layer_5"
       },
       "registered_name": null,
       "name": "input_layer_5",
       "inbound_nodes": []
      },
      {
       "module": "keras.layers",
       "class_name": "Rescaling",
       "config": {
        "name": "rescaling_1",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "scale": 0.00392156862745098,
        "offset": 0.0
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         224,
         224,
         3
        ]
       },
       "name": "rescaling_1",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             224,
             224,
             3
            ],
            "dtype": "float32",
            "keras_history": [
             "input_layer_5",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Normalization",
       "config": {
        "name": "normalization_1",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": [
         3
        ],
        "invert": false,
        "mean": [
         0.485,
         0.456,
         0.406
        ],
        "variance": [
         0.052441,
         0.050176000000000005,
         0.050625
        ]
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         224,
         224,
         3
        ]
       },
       "name": "normalization_1",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             224,
             224,
             3
            ],
            "dtype": "float32",
            "keras_history": [
             "rescaling_1",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "stem_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 40,
        "kernel_size": [
         3,
         3
        ],
        "strides": [
         2,
         2
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         224,
         224,
         3
        ]
       },
       "name": "stem_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             224,
             224,
             3
            ],
            "dtype": "float32",
            "keras_history": [
             "normalization_1",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "stem_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         112,
         112,
         40
        ]
       },
       "name": "stem_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "stem_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Activation",
       "config": {
        "name": "stem_activation",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "activation": "silu"
       },
       "registered_name": null,
       "name": "stem_activation",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "stem_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block1a_project_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 16,
        "kernel_size": [
         3,
         3
        ],
        "strides": [
         1,
         1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         112,
         112,
         40
        ]
       },
       "name": "block1a_project_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "stem_activation",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block1a_project_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         112,
         112,
         16
        ]
       },
       "name": "block1a_project_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             16
            ],
            "dtype": "float32",
            "keras_history": [
             "block1a_project_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Activation",
       "config": {
        "name": "block1a_project_activation",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "activation": "silu"
       },
       "registered_name": null,
       "name": "block1a_project_activation",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             16
            ],
            "dtype": "float32",
            "keras_history": [
             "block1a_project_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block1b_project_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 16,
        "kernel_size": [
         3,
         3
        ],
        "strides": [
         1,
         1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         112,
         112,
         16
        ]
       },
       "name": "block1b_project_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             16
            ],
            "dtype": "float32",
            "keras_history": [
             "block1a_project_activation",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block1b_project_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         112,
         112,
         16
        ]
       },
       "name": "block1b_project_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             16
            ],
            "dtype": "float32",
            "keras_history": [
             "block1b_project_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Activation",
       "config": {
        "name": "block1b_project_activation",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "activation": "silu"
       },
       "registered_name": null,
       "name": "block1b_project_activation",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             16
            ],
            "dtype": "float32",
            "keras_history": [
             "block1b_project_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Dropout",
       "config": {
        "name": "block1b_drop",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "rate": 0.009523809523809525,
        "seed": null,
        "noise_shape": [
         null,
         1,
         1,
         1
        ]
       },
       "registered_name": null,
       "name": "block1b_drop",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             16
            ],
            "dtype": "float32",
            "keras_history": [
             "block1b_project_activation",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "training": false
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Add",
       "config": {
        "name": "block1b_add",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        }
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         [
          null,
          112,
          112,
          16
         ],
         [
          null,
          112,
          112,
          16
         ]
        ]
       },
       "name": "block1b_add",
       "inbound_nodes": [
        {
         "args": [
          [
           {
            "class_name": "__keras_tensor__",
            "config": {
             "shape": [
              null,
              112,
              112,
              16
             ],
             "dtype": "float32",
             "keras_history": [
              "block1b_drop",
              0,
              0
             ]
            }
           },
           {
            "class_name": "__keras_tensor__",
            "config": {
             "shape": [
              null,
              112,
              112,
              16
             ],
             "dtype": "float32",
             "keras_history": [
              "block1a_project_activation",
              0,
              0
             ]
            }
           }
          ]
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block2a_expand_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
         3,
         3
        ],
        "strides": [
         2,
         2
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         112,
         112,
         16
        ]
       },
       "name": "block2a_expand_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             112,
             112,
             16
            ],
            "dtype": "float32",
            "keras_history": [
             "block1b_add",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block2a_expand_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         64
        ]
       },
       "name": "block2a_expand_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             64
            ],
            "dtype": "float32",
            "keras_history": [
             "block2a_expand_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Activation",
       "config": {
        "name": "block2a_expand_activation",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "activation": "silu"
       },
       "registered_name": null,
       "name": "block2a_expand_activation",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             64
            ],
            "dtype": "float32",
            "keras_history": [
             "block2a_expand_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block2a_project_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 40,
        "kernel_size": [
         1,
         1
        ],
        "strides": [
         1,
         1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         64
        ]
       },
       "name": "block2a_project_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             64
            ],
            "dtype": "float32",
            "keras_history": [
             "block2a_expand_activation",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block2a_project_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         40
        ]
       },
       "name": "block2a_project_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "block2a_project_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block2b_expand_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 160,
        "kernel_size": [
         3,
         3
        ],
        "strides": [
         1,
         1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         40
        ]
       },
       "name": "block2b_expand_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "block2a_project_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block2b_expand_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         160
        ]
       },
       "name": "block2b_expand_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             160
            ],
            "dtype": "float32",
            "keras_history": [
             "block2b_expand_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Activation",
       "config": {
        "name": "block2b_expand_activation",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "activation": "silu"
       },
       "registered_name": null,
       "name": "block2b_expand_activation",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             160
            ],
            "dtype": "float32",
            "keras_history": [
             "block2b_expand_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block2b_project_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 40,
        "kernel_size": [
         1,
         1
        ],
        "strides": [
         1,
         1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         160
        ]
       },
       "name": "block2b_project_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             160
            ],
            "dtype": "float32",
            "keras_history": [
             "block2b_expand_activation",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block2b_project_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         40
        ]
       },
       "name": "block2b_project_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "block2b_project_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Dropout",
       "config": {
        "name": "block2b_drop",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "rate": 0.028571428571428574,
        "seed": null,
        "noise_shape": [
         null,
         1,
         1,
         1
        ]
       },
       "registered_name": null,
       "name": "block2b_drop",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "block2b_project_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "training": false
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Add",
       "config": {
        "name": "block2b_add",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        }
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         [
          null,
          56,
          56,
          40
         ],
         [
          null,
          56,
          56,
          40
         ]
        ]
       },
       "name": "block2b_add",
       "inbound_nodes": [
        {
         "args": [
          [
           {
            "class_name": "__keras_tensor__",
            "config": {
             "shape": [
              null,
              56,
              56,
              40
             ],
             "dtype": "float32",
             "keras_history": [
              "block2b_drop",
              0,
              0
             ]
            }
           },
           {
            "class_name": "__keras_tensor__",
            "config": {
             "shape": [
              null,
              56,
              56,
              40
             ],
             "dtype": "float32",
             "keras_history": [
              "block2a_project_bn",
              0,
              0
             ]
            }
           }
          ]
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block2c_expand_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 160,
        "kernel_size": [
         3,
         3
        ],
        "strides": [
         1,
         1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         40
        ]
       },
       "name": "block2c_expand_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             40
            ],
            "dtype": "float32",
            "keras_history": [
             "block2b_add",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block2c_expand_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         160
        ]
       },
       "name": "block2c_expand_bn",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             160
            ],
            "dtype": "float32",
            "keras_history": [
             "block2c_expand_conv",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {
          "mask": null
         }
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Activation",
       "config": {
        "name": "block2c_expand_activation",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "activation": "silu"
       },
       "registered_name": null,
       "name": "block2c_expand_activation",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             160
            ],
            "dtype": "float32",
            "keras_history": [
             "block2c_expand_bn",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "Conv2D",
       "config": {
        "name": "block2c_project_conv",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "filters": 40,
        "kernel_size": [
         1,
         1
        ],
        "strides": [
         1,
         1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
         1,
         1
        ],
        "groups": 1,
        "activation": "linear",
        "use_bias": false,
        "kernel_initializer": {
         "module": "keras.initializers",
         "class_name": "VarianceScaling",
         "config": {
          "seed": null,
          "scale": 2.0,
          "mode": "fan_out",
          "distribution": "truncated_normal"
         },
         "registered_name": null
        },
        "bias_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
       },
       "registered_name": null,
       "build_config": {
        "input_shape": [
         null,
         56,
         56,
         160
        ]
       },
       "name": "block2c_project_conv",
       "inbound_nodes": [
        {
         "args": [
          {
           "class_name": "__keras_tensor__",
           "config": {
            "shape": [
             null,
             56,
             56,
             160
            ],
            "dtype": "float32",
            "keras_history": [
             "block2c_expand_activation",
             0,
             0
            ]
           }
          }
         ],
         "kwargs": {}
        }
       ]
      },
      {
       "module": "keras.layers",
       "class_name": "BatchNormalization",
       "config": {
        "name": "block2c_project_bn",
        "trainable": false,
        "dtype": {
         "module": "keras",
         "class_name": "DTypePolicy",
         "config": {
          "name": "float32"
         },
         "registered_name": null
        },
        "axis": 3,
        "momentum": 0.9,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "gamma_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
         "config": {},
         "registered_name": null
        },
        "moving_mean_initializer": {
         "module": "keras.initializers",
         "class_name": "Zeros",
         "config": {},
         "registered_name": null
        },
        "moving_variance_initializer": {
         "module": "keras.initializers",
         "class_name": "Ones",
